
crypto_dic = {
    "А": "В", "Б": ";", "В": "%", "Г": ":", "Д": "}",
    "Е": "@", "Ё": "!", "Ж": "$", "З": "~", "И": "(",
    "Й": ")", "К": "{", "Л": "|", "М": "/", "Н": "?",
    "О": "<", "П": ">", "Р": ",", "С": ".", "Т": "*",
    "У": "6", "Ф": "О", "Х": "0", "Ц": "И", "Ч": "Х",
    "Ш": "Ъ", "Щ": "Э", "Ъ": "Ё", "Ы": "Ь", "Ь": "Ж",
    "Э": "Т", "Ю": "3", "Я": "7", " ": " "
}

decrypto_dic = {a: b for b, a in crypto_dic.items()}

txt_input = str(input('Введите текст: '))
txt_input = txt_input.upper()
txt_output = ''
print('$------------------$\n'
      'Выберите действие:\n\n'
      '1. Зашифровать.\n'
      '2. Расшифровать.\n')

a = str(input('Ввод: '))

if a == '1':
    for i in txt_input:
        txt_output += crypto_dic[i]
elif a == '2':
    for i in txt_input:
        txt_output += decrypto_dic[i]
else:
    print('Ошибка, вводите 1 или 2')

print('\nВывод: ', txt_output)

'''
Съешь ещё этих мягких французских булок да выпей же чаю
'''
